Tekla.Structures.Analysis.AnalysisModelModalAnalysisProperties
The AnalysisModelModalAnalysisProperties class contains information related to analysis model modal analysis properties.

Tekla.Structures.Analysis.AnalysisModelModalAnalysisProperties._AnalysisModelName
The name of the analysis model.

Tekla.Structures.Analysis.AnalysisModelModalAnalysisProperties._ModalAnalysisModel
This indicates whether a modal analysis model is used.

Tekla.Structures.Analysis.AnalysisModelModalAnalysisProperties._ModalAnalysisModeCount
The modal analysis mode count.

Tekla.Structures.Analysis.AnalysisModelModalAnalysisProperties._ModalAnalysisMaxFrequency
The modal analysis maximum frequence.

Tekla.Structures.Analysis.AnalysisModelModalAnalysisProperties._ModalAnalysisIncludeSelfWeightMass
This indicates whether selfweight mass is included in the modal analysis.

Tekla.Structures.Analysis.AnalysisModelModalAnalysisProperties._ModalAnalysisMassLoadGroupIds
The mass load group indentifier of the modal analysis.

Tekla.Structures.Analysis.AnalysisModelModalAnalysisProperties._ModalAnalysisMassLoadGroupFactors
The mass load group factors of the modal analysis.

Tekla.Structures.Analysis.AnalysisModelModalAnalysisProperties._ModalAnalysisMassLoadGroupDirections
The mass load group directions of the modal analysis.

Tekla.Structures.Analysis.AnalysisModelModalAnalysisProperties.ModalAnalysisModel
Indicates whether a modal analysis model is used.

Tekla.Structures.Analysis.AnalysisModelModalAnalysisProperties.ModalAnalysisModeCount
The modal analysis mode count.

Tekla.Structures.Analysis.AnalysisModelModalAnalysisProperties.ModalAnalysisMaxFrequency
The modal analysis maximum frequence.

Tekla.Structures.Analysis.AnalysisModelModalAnalysisProperties.ModalAnalysisIncludeSelfWeightMass
Indicates whether selfweight mass is included in the modal analysis.

Tekla.Structures.Analysis.AnalysisModelModalAnalysisProperties.ModalAnalysisMassLoadGroupIds
The mass load group indentifier of the modal analysis.

Tekla.Structures.Analysis.AnalysisModelModalAnalysisProperties.ModalAnalysisMassLoadGroupFactors
The mass load group factors of the modal analysis.

Tekla.Structures.Analysis.AnalysisModelModalAnalysisProperties.ModalAnalysisMassLoadGroupDirections
The mass load group directions of the modal analysis.

Tekla.Structures.Analysis.AnalysisModelModalAnalysisProperties.Modify(System.String)
Inserts the analysis model modal analysis properties.
The AnalysisModelName has to be set.
AnalysisModelName: The name of the analysis model.

Tekla.Structures.Analysis.AnalysisModelModalAnalysisProperties.Select(System.String)
Selects the analysis model modal analysis properties.
The AnalysisModelName has to be set.

Tekla.Structures.Analysis.AnalysisModelModalAnalysisProperties.ModifyInstance
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.AnalysisModelModalAnalysisProperties.SelectInstance
DO NOT USE! For internal usage only!
Returns: Returns true if successfully selected the analysis model modal analysis properties.